class TaskRequirements {
  static const Map<String, int> buildTypeByTaskId = {
    // L1:
    'L1_1': 1, // Мэрия
    'L1_3': 3, // Школа
    'L1_4': 2, // Магазин

    // L2:
    'L2_2':  /* Банк */  4,
    'L2_4':  /* Кафе */  5,
    'L2_5':  /* Больница */ 6,
    'L2_6':  /* Полиция */  7,

    // L3:
    //'L3_1':  /* Статуя */   7,
    'L3_2':  /* АЗС */      9,
    'L3_3':  /* Кино */     8,
    'L3_4':  /* Пожарка */  10,
    //'L3_5':  /* Библиотека */ 11,
    //'L3_6':  /* ПВЗ */      12,
    // L4:
    //'L4_5':  /* Зоопарк */  13,
    //'L4_6':  /* Аптека */   14,
  };

  static const Map<String, int> coinsByTaskId = {
    'L1_2': 200, //
    'L2_1': 400, //
    'L3_1': 600, //
    'L4_3': 800, //
  };
}
